
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.ПолноеНаименование) Тогда
		Объект.ПолноеНаименование = Объект.Наименование;
	КонецЕсли;
	
	ПриИзмененииНаименованияНаСервере();
	
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииНаименованияНаСервере()
	
	ТаблицаДокумента = Новый ТаблицаЗначений;
	ТаблицаДокумента.Колонки.Добавить("Наименование");
	ТаблицаДокумента.Колонки.Добавить("Дата");
	
	НоваяСтрока = ТаблицаДокумента.Добавить();
	НоваяСтрока.Дата = Дата(2024, 12, 01);
	НоваяСтрока.Наименование = "Иванов";

	НоваяСтрока = ТаблицаДокумента.Добавить();
	НоваяСтрока.Дата = Дата(2023, 09, 01);
	НоваяСтрока.Наименование = "Петров";
	а = 2;
 
КонецПроцедуры


#КонецОбласти
