
&НаКлиенте
Процедура ЧерезМенедежра(Команда)
	ЧерезМенедежраНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЧерезМенедежраНаСервере()
	
	Сообщить(Справочники.Должности.ВернутьИмя());
	
КонецПроцедуры

&НаКлиенте
Процедура ЧерезОбъект(Команда)
	
	ТекущийЭлемент = Элементы.Список.ТекущийЭлемент;
	ТекущиеДанные = ТекущийЭлемент.ТекущиеДанные;
	
	ЧерезОбъектНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЧерезОбъектНаСервере()
	
	СсылкаНаДолжность = Справочники.Должности.ПустаяСсылка(); 
	
	ДолжнОбъект = СсылкаНаДолжность.ПолучитьОбъект();
	Сообщить(ДолжнОбъект.ВернутьИмя());
	
КонецПроцедуры
