
&НаСервере
Процедура ЗаполнитьХарактеристикиДолжности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Объект.Должность);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДолжностиХарактеристики.Характеристика КАК Характеристика,
	|	ЛОЖЬ КАК Требуется
	|ИЗ
	|	Справочник.Должности.Характеристики КАК ДолжностиХарактеристики
	|ГДЕ
	|	ДолжностиХарактеристики.Ссылка = &Ссылка";
	
	Объект.Характеристики.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФункциональныеОбязанностиДолжности()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владелец", Объект.Должность);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ФункциональныеОбязанности.Ссылка КАК ФункциональнаяОбязанность,
	|	ЛОЖЬ КАК Требуется
	|ИЗ
	|	Справочник.ФункциональныеОбязанности КАК ФункциональныеОбязанности
	|ГДЕ
	|	ФункциональныеОбязанности.Владелец = &Владелец";
	
	Объект.ФункциональныеОбязанности.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ДолжностьПриИзмененииНаСервере()
	
	Объект.Характеристики.Очистить();
	Объект.ФункциональныеОбязанности.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Должность) Тогда
		ЗаполнитьХарактеристикиДолжности();
		ЗаполнитьФункциональныеОбязанностиДолжности();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	ДолжностьПриИзмененииНаСервере();
КонецПроцедуры
